#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Pusher: @logica0419, Action: `pull_request`

<details><summary>Show Plan</summary>

```text
terraform
sakuracloud_internet.k8s_external_switch: Refreshing state... [id=113501638737]
data.sakuracloud_archive.ubuntu_archive: Reading...
sakuracloud_switch.k8s_internal_switch: Refreshing state... [id=113501638735]
sakuracloud_ssh_key_gen.gen_key: Refreshing state... [id=113501638736]
sakuracloud_disk.k8s_rook_disk[2]: Refreshing state... [id=113501638740]
sakuracloud_disk.k8s_rook_disk[0]: Refreshing state... [id=113501638743]
sakuracloud_disk.k8s_rook_disk[1]: Refreshing state... [id=113501638739]
data.sakuracloud_archive.ubuntu_archive: Read complete after 2s [id=113402076881]
sakuracloud_disk.k8s_control_plane_disk[1]: Refreshing state... [id=113501638751]
sakuracloud_disk.k8s_control_plane_disk[0]: Refreshing state... [id=113501638749]
sakuracloud_disk.k8s_control_plane_disk[2]: Refreshing state... [id=113501638750]
sakuracloud_disk.k8s_lb_disk[0]: Refreshing state... [id=113501638745]
sakuracloud_disk.k8s_lb_disk[1]: Refreshing state... [id=113501638742]
sakuracloud_disk.k8s_router_disk[0]: Refreshing state... [id=113501638744]
sakuracloud_disk.k8s_worker_node_disk[2]: Refreshing state... [id=113501638747]
sakuracloud_disk.k8s_worker_node_disk[0]: Refreshing state... [id=113501638746]
sakuracloud_disk.k8s_worker_node_disk[1]: Refreshing state... [id=113501638738]
sakuracloud_subnet.bgp_subnet: Refreshing state... [id=15318]
sakuracloud_server.k8s_worker_node[1]: Refreshing state... [id=113501638769]
sakuracloud_server.k8s_control_plane[2]: Refreshing state... [id=113501638776]
sakuracloud_server.k8s_control_plane[1]: Refreshing state... [id=113501638777]
sakuracloud_server.k8s_worker_node[0]: Refreshing state... [id=113501638768]
sakuracloud_server.k8s_lb[0]: Refreshing state... [id=113501638758]
sakuracloud_server.k8s_control_plane[0]: Refreshing state... [id=113501638778]
sakuracloud_server.k8s_worker_node[2]: Refreshing state... [id=113501638767]
sakuracloud_server.k8s_router[0]: Refreshing state... [id=113501638762]
sakuracloud_server.k8s_lb[1]: Refreshing state... [id=113501638759]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # sakuracloud_disk.k8s_control_plane_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501638749" -> (known after apply)
        name              = "k8s-control-plane-1-dev"
      ~ server_id         = "113501638778" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501638751" -> (known after apply)
        name              = "k8s-control-plane-2-dev"
      ~ server_id         = "113501638777" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_control_plane_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_control_plane_disk" {
      ~ id                = "113501638750" -> (known after apply)
        name              = "k8s-control-plane-3-dev"
      ~ server_id         = "113501638776" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501638745" -> (known after apply)
        name              = "k8s-lb-1-dev"
      ~ server_id         = "113501638758" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_lb_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_lb_disk" {
      ~ id                = "113501638742" -> (known after apply)
        name              = "k8s-lb-2-dev"
      ~ server_id         = "113501638759" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_router_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_router_disk" {
      ~ id                = "113501638744" -> (known after apply)
        name              = "k8s-router-1-dev"
      ~ server_id         = "113501638762" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[0] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501638746" -> (known after apply)
        name              = "k8s-worker-node-1-dev"
      ~ server_id         = "113501638768" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[1] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501638738" -> (known after apply)
        name              = "k8s-worker-node-2-dev"
      ~ server_id         = "113501638769" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_disk.k8s_worker_node_disk[2] must be replaced
-/+ resource "sakuracloud_disk" "k8s_worker_node_disk" {
      ~ id                = "113501638747" -> (known after apply)
        name              = "k8s-worker-node-3-dev"
      ~ server_id         = "113501638767" -> (known after apply)
      ~ source_archive_id = "113402076879" -> "113402076881" # forces replacement
        tags              = [
            "dev",
            "k8s",
        ]
      ~ zone              = "tk1b" -> (known after apply)
        # (3 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # sakuracloud_server.k8s_control_plane[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501638749",
        ] -> (known after apply)
        id               = "113501638778"
        name             = "k8s-control-plane-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501638751",
        ] -> (known after apply)
        id               = "113501638777"
        name             = "k8s-control-plane-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_control_plane[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_control_plane" {
      ~ disks            = [
          - "113501638750",
        ] -> (known after apply)
        id               = "113501638776"
        name             = "k8s-control-plane-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501638745",
        ] -> (known after apply)
        id               = "113501638758"
        name             = "k8s-lb-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_lb[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_lb" {
      ~ disks            = [
          - "113501638742",
        ] -> (known after apply)
        id               = "113501638759"
        name             = "k8s-lb-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_router[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_router" {
      ~ disks            = [
          - "113501638744",
        ] -> (known after apply)
        id               = "113501638762"
        name             = "k8s-router-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[0] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501638746",
          - "113501638743",
        ] -> (known after apply)
        id               = "113501638768"
        name             = "k8s-worker-node-1-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[1] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501638738",
          - "113501638739",
        ] -> (known after apply)
        id               = "113501638769"
        name             = "k8s-worker-node-2-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # sakuracloud_server.k8s_worker_node[2] will be updated in-place
  ~ resource "sakuracloud_server" "k8s_worker_node" {
      ~ disks            = [
          - "113501638747",
          - "113501638740",
        ] -> (known after apply)
        id               = "113501638767"
        name             = "k8s-worker-node-3-dev"
        tags             = [
            "@nic-double-queue",
            "dev",
            "k8s",
        ]
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

Plan: 9 to add, 9 to change, 9 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>